[
    {
        "id": 1,
        "title": "Shangri-La Frontier: Kusoge Hunter, Kamige ni Idoman to su 2nd Season",
        "image": "shangrilafrontiers2.jpg",
        "genre": "Action, Adventure, Fantasy",
        "rating": "8.14",
        "studio": "C2C",
        "status": "Ongoing",
        "type": "TV",
        "episodes": "12",
        "duration": "23 min per episode",
        "synopsis": "Second season of Shangri-La Frontier: Kusoge Hunter, Kamige ni Idoman to su."
    },
    {
        "id": 2,
        "title": "Kimetsu no Yaiba: Hashira Geiko-hen",
        "image": "knygeiko.jpg",
        "genre": "Action, Supernatural",
        "rating": "8.13",
        "studio": "ufotable",
        "status": "Completed",
        "type": "TV",
        "episodes": "8",
        "duration": "29 min per episode",
        "synopsis": "After a series of mighty clashes with Upper Rank Demons, the Ubuyashiki clan prepares for one last battle with the hellish forces of Muzan Kibutsuji. In order to finally defeat the Demon leader once and for all, the clan devises a training camp for the Demon Slayer Corps, one led by the remaining Hashira—the most elite warriors in the organization. Each Hashira forms a specialized exercise that will hone both their own abilities and the skills of the ordinary soldiers.\n\nTanjirou Kamado, a boy at the heart of the brewing conflict, recovers from wounds received in a recent fight. While his half-Demon sister Nezuko is studied by researchers like Shinobu Kochou, Tanjirou embarks to train with the Hashira, seeking mastery in each of their assigned areas of expertise to be best prepared for the coming war—skills vital to Tanjirou, as he has vowed to be the very warrior who will eliminate Muzan for good."
    },
    {
        "id": 3,
        "title": "Jujutsu Kaisen 2nd Season",
        "image": "jujutsukaisens2.jpg",
        "genre": "Action, Supernatural",
        "rating": "8.79",
        "studio": "MAPPA",
        "status": "Completed",
        "type": "TV",
        "episodes": "23",
        "duration": "23 min per episode",
        "synopsis": "The year is 2006, and the halls of Tokyo Prefectural Jujutsu High School echo with the endless bickering and intense debate between two inseparable best friends. Exuding unshakeable confidence, Satoru Gojou and Suguru Getou believe there is no challenge too great for young and powerful Special Grade sorcerers such as themselves. They are tasked with safely delivering a sensible girl named Riko Amanai to the entity whose existence is the very essence of the jujutsu world. However, the mission plunges them into an exhausting swirl of moral conflict that threatens to destroy the already feeble amity between sorcerers and ordinary humans.\n\nTwelve years later, students and sorcerers are the frontline defense against the rising number of high-level curses born from humans' negative emotions. As the entities grow in power, their self-awareness and ambition increase too. The curses unite for the common goal of eradicating humans and creating a world of only cursed energy users, led by a dangerous, ancient cursed spirit. To dispose of their greatest obstacle—the strongest sorcerer, Gojou—they orchestrate an attack at Shibuya Station on Halloween. Dividing into teams, the sorcerers enter the fight prepared to risk everything to protect the innocent and their own kind."
    },
    {
        "id": 4,
        "title": "Spy x Family",
        "image": "spyxfamily.jpg",
        "genre": "Action, Award Winning, Comedy",
        "rating": "8.75",
        "studio": "WIT Studio, CloverWorks",
        "status": "Completed",
        "type": "TV",
        "episodes": "12",
        "duration": "24 min per episode",
        "synopsis": "Corrupt politicians, frenzied nationalists, and other warmongering forces constantly jeopardize the thin veneer of peace between neighboring countries Ostania and Westalis. In spite of their plots, renowned spy and master of disguise \"Twilight\" fulfills dangerous missions one after another in the hope that no child will have to experience the horrors of war.\n\nIn the bustling Ostanian city of Berlint, Twilight dons the alias of \"Loid Forger,\" an esteemed psychiatrist. However, his true intention is to gather intelligence on prominent politician Donovan Desmond, who only appears rarely in public at his sons' school: the prestigious Eden Academy. Enlisting the help of unmarried city hall clerk Yor Briar to act as his wife and adopting the curious six-year-old orphan Anya as his daughter, Loid enacts his master plan. He will enroll Anya in Eden Academy, where Loid hopes she will excel and give him the opportunity to meet Donovan without arousing suspicion.\n\nUnfortunately for Loid, even a man of his talents has trouble playing the figure of a loving father and husband. And just like Loid is hiding his true identity, Yor—who is an underground assassin known as \"Thorn Princess\"—and Anya—an esper who can read people's minds—have no plans to disclose their own secrets either. Although this picture-perfect family is founded on deception, the Forgers gradually come to understand that the love they share for one another trumps all else."
    },
    {
        "id": 5,
        "title": "Attack on Titan: The Final Season",
        "image": "aotfinal.jpg",
        "genre": "Action, Drama, Suspense",
        "rating": "8.78",
        "studio": "MAPPA",
        "status": "Completed",
        "type": "TV",
        "episodes": "16",
        "duration": "23 min per episode",
        "synopsis": "Gabi Braun and Falco Grice have been training their entire lives to inherit one of the seven Titans under Marley's control and aid their nation in eradicating the Eldians on Paradis. However, just as all seems well for the two cadets, their peace is suddenly shaken by the arrival of Eren Yeager and the remaining members of the Survey Corps.\n\nHaving finally reached the Yeager family basement and learned about the dark history surrounding the Titans, the Survey Corps has at long last found the answer they so desperately fought to uncover. With the truth now in their hands, the group set out for the world beyond the walls.\n\nIn Shingeki no Kyojin: The Final Season, two utterly different worlds collide as each party pursues its own agenda in the long-awaited conclusion to Paradis' fight for freedom."
    },
    {
        "id": 6,
        "title": "One Piece",
        "image": "onepiece.jpg",
        "genre": "Action, Adventure, Fantasy",
        "rating": "8.66",
        "studio": "Toei Animation",
        "status": "Ongoing",
        "type": "TV",
        "episodes": "Uknown",
        "duration": "24 min per episode",
        "synopsis": "Barely surviving in a barrel after passing through a terrible whirlpool at sea, carefree Monkey D. Luffy ends up aboard a ship under attack by fearsome pirates. Despite being a naive-looking teenager, he is not to be underestimated. Unmatched in battle, Luffy is a pirate himself who resolutely pursues the coveted One Piece treasure and the King of the Pirates title that comes with it.\n\nThe late King of the Pirates, Gol D. Roger, stirred up the world before his death by disclosing the whereabouts of his hoard of riches and daring everyone to obtain it. Ever since then, countless powerful pirates have sailed dangerous seas for the prized One Piece only to never return. Although Luffy lacks a crew and a proper ship, he is endowed with a superhuman ability and an unbreakable spirit that make him not only a formidable adversary but also an inspiration to many.\n\nAs he faces numerous challenges with a big smile on his face, Luffy gathers one-of-a-kind companions to join him in his ambitious endeavor, together embracing perils and wonders on their once-in-a-lifetime adventure."
    },
    {
        "id": 7,
        "title": "My Hero Academia",
        "image": "myheroacademia.jpg",
        "genre": "Action, Super Power, School",
        "rating": "7.85",
        "studio": "Bones",
        "status": "Completed",
        "type": "TV",
        "episodes": "13",
        "duration": "24 min per episode",
        "synopsis": "The appearance of \"quirks,\" newly discovered super powers, has been steadily increasing over the years, with 80 percent of humanity possessing various abilities from manipulation of elements to shapeshifting. This leaves the remainder of the world completely powerless, and Izuku Midoriya is one such individual.\n\nSince he was a child, the ambitious middle schooler has wanted nothing more than to be a hero. Izuku's unfair fate leaves him admiring heroes and taking notes on them whenever he can. But it seems that his persistence has borne some fruit: Izuku meets the number one hero and his personal idol, All Might. All Might's quirk is a unique ability that can be inherited, and he has chosen Izuku to be his successor!\n\nEnduring many months of grueling training, Izuku enrolls in UA High, a prestigious high school famous for its excellent hero training program, and this year's freshmen look especially promising. With his bizarre but talented classmates and the looming threat of a villainous organization, Izuku will soon learn what it really means to be a hero."
    },
    {
        "id": 8,
        "title": "Naruto Shippuden",
        "image": "narutoshippuden.jpg",
        "genre": "Action, Adventure, Martial Arts",
        "rating": "8.27",
        "studio": "Studio Pierrot",
        "status": "Completed",
        "type": "TV",
        "episodes": "500",
        "duration": "23 min per episode",
        "synopsis": "It has been two and a half years since Naruto Uzumaki left Konohagakure, the Hidden Leaf Village, for intense training following events which fueled his desire to be stronger. Now Akatsuki, the mysterious organization of elite rogue ninja, is closing in on their grand plan which may threaten the safety of the entire shinobi world.\n\nAlthough Naruto is older and sinister events loom on the horizon, he has changed little in personality—still rambunctious and childish—though he is now far more confident and possesses an even greater determination to protect his friends and home. Come whatever may, Naruto will carry on with the fight for what is important to him, even at the expense of his own body, in the continuation of the saga about the boy who wishes to become Hokage."
    },
    {
        "id": 9,
        "title": "Tokyo Revengers",
        "image": "tokyorevengers.jpg",
        "genre": "Action, Drama, School",
        "rating": "8.33",
        "studio": "LIDENFILMS",
        "status": "Completed",
        "type": "TV",
        "episodes": "24",
        "duration": "24 min per episode",
        "synopsis": "Takemichi Hanagaki's second year of middle school was the highest point in his life. He had respect, a gang of friends he could count on, and even a girlfriend. But that was twelve years ago. Today, he's a nobody: a washed-up nonentity made fun of by children"
    },
    {
        "id": 10,
        "title": "Black Clover",
        "image": "blackclover.jpg",
        "genre": "Action, Magic, Fantasy",
        "rating": "8.14",
        "studio": "Studio Pierrot",
        "status": "Completed",
        "type": "TV",
        "episodes": "170",
        "duration": "23 min per episode",
        "synopsis": "Asta and Yuno were abandoned at the same church on the same day. Raised together as children, they came to know of the \"Wizard King\"—a title given to the strongest mage in the Clover Kingdom, but also considered the most desirable position for mages in the world. However, the two friends were quickly divided between them: Yuno was a genius with magic, with amazing power and control, while Asta could not use magic at all and tried to make up for his lack of magic with physical training.\n\nWhen they reach the age of 15, Yuno is bestowed a spectacular Grimoire with a four-leaf clover, while Asta receives nothing. However, soon after, Yuno is attacked by a person named Lebuty, whose main purpose is to obtain Yuno's Grimoire. Asta tries to fight Lebuty, but he is outmatched. Though without hope and on the brink of defeat, he finds the strength to continue when he hears Yuno's voice. Unleashing his inner emotions in a rage, Asta receives a five-leaf clover Grimoire, a \"Black Clover\" giving him enough power to defeat Lebuty. A few days later, the two friends head out into the world, both seeking the same goal—to become the Wizard King!"
    },
    {
        "id": 11,
        "title": "Sousou no Frieren",
        "image": "sousounofrieren.jpg",
        "genre": "Adventure, Drama, Fantasy",
        "rating": "9.32",
        "studio": "Madhouse",
        "status": "Completed",
        "type": "TV",
        "episodes": "28",
        "duration": "24 min per episode",
        "synopsis": "During their decade-long quest to defeat the Demon King, the members of the hero's party—Himmel himself, the priest Heiter, the dwarf warrior Eisen, and the elven mage Frieren—forge bonds through adventures and battles, creating unforgettable precious memories for most of them.\n\nHowever, the time that Frieren spends with her comrades is equivalent to merely a fraction of her life, which has lasted over a thousand years. When the party disbands after their victory, Frieren casually returns to her \"usual\" routine of collecting spells across the continent. Due to her different sense of time, she seemingly holds no strong feelings toward the experiences she went through.\n\nAs the years pass, Frieren gradually realizes how her days in the hero's party truly impacted her. Witnessing the deaths of two of her former companions, Frieren begins to regret having taken their presence for granted; she vows to better understand humans and create real personal connections. Although the story of that once memorable journey has long ended, a new tale is about to begin."
    },
    {
        "id": 12,
        "title": "Dandadan",
        "image": "dandadan.jpg",
        "genre": "Action, Comedy, Supernatural",
        "rating": "8.63",
        "studio": "Science SARU",
        "status": "Ongoing",
        "type": "TV",
        "episodes": "12",
        "duration": "23 min per episode",
        "synopsis": "After being aggressively rejected, Momo Ayase finds herself sulking when she stumbles across a boy being bullied. Saved by her rash kindness, the alien-obsessed boy attempts to speak to her about extraterrestrial interests he believes they share. Rejecting his claims, Ayase proclaimed that she instead is a believer in ghosts, starting an argument between the two over which is real.\n\nIn a bet to determine who is correct, the two decide to separately visit locations associated with both the extraterrestrial and the supernatural—Ayase visiting the former and the boy visiting the latter. When the two reach their respective places, it turns out that neither was wrong and that both aliens and ghosts do exist.\n\nThis marks the beginning of Ayase and the boy's adventure, as they attempt to fix the surreal, supernatural, and extraterrestrial elements around them to return to a normal life."
    },
    {
        "id": 13,
        "title": "Seirei Gensouki 2",
        "image": "seireigensouki2.jpg",
        "genre": "Action, Adventure, Fantasy, Romance",
        "rating": "7.05",
        "studio": " TMS Entertainment",
        "status": "Ongoing",
        "type": "TV",
        "episodes": "12",
        "duration": "23 min per episode",
        "synopsis": "Second season of Seirei Gensouki."
    },
    {
        "id": 14,
        "title": "Ao no Hako",
        "image": "aonohako.jpg",
        "genre": "Romance, Sports",
        "rating": "8.41",
        "studio": "Telecom Animation Film",
        "status": "Ongoing",
        "type": "TV",
        "episodes": "25",
        "duration": "23 min per episode",
        "synopsis": "Every morning, incoming first-year Taiki Inomata hurries to his high school gym in order to further refine his badminton skills. However, his true motivation stems from sharing the otherwise empty gym with second-year Chinatsu Kano, Taiki's crush and the star player of the girls' basketball team. Although Chinatsu seems unapproachable, Taiki gradually finds opportunities to get to know her little by little.\n\nUnbeknownst to Taiki, his tireless work ethic and admiration motivate Chinatsu to work harder and strive to achieve her greatest ambitions. When her family must suddenly move overseas for work, Chinatsu decides to remain in Japan and shoot for victory at the national level. With nowhere to stay, she is taken in by Taiki's mother, who is longtime friends with Chinatsu's own. Overwhelmed with the new reality of living alongside the girl he loves, Taiki resolves to join Chinatsu at the national level in his own sport—and grow closer to her in the process.\n\nStill, despite being good enough to catch his coach's eye, Taiki must fight an uphill battle to qualify for a spot on the starting team. Cheered on by both Chinatsu and gymnast Hina Chouno, his childhood friend, Taiki aims to make a name for himself among his powerful upperclassmen."
    },
    {
        "id": 15,
        "title": "Re:Zero kara Hajimeru Isekai Seikatsu 3rd Season",
        "image": "rezero3.jpg",
        "genre": "Drama, Fantasy, Suspense",
        "rating": "8.87",
        "studio": "White Fox",
        "status": "Ongoing",
        "type": "TV",
        "episodes": "16",
        "duration": "23 min per episode",
        "synopsis": "Third season of Re:Zero kara Hajimeru Isekai Seikatsu."
    },
    {
        "id": 16,
        "title": "Sword Art Online Alternative: Gun Gale Online II",
        "image": "saoggo2.jpg",
        "genre": "Action",
        "rating": "7.22",
        "studio": "A-1 Pictures",
        "status": "Ongoing",
        "type": "TV",
        "episodes": "12",
        "duration": "23 min per episode",
        "synopsis": "Second season of Sword Art Online Alternative: Gun Gale Online."
    },
    {
        "id": 17,
        "title": "Kami no Tou: Koubou-sen",
        "image": "togs2.jpg",
        "genre": "Action, Adventure, Drama, Fantasy, Mystery",
        "rating": "7.24",
        "studio": "The Answer Studio",
        "status": "Ongoing",
        "type": "TV",
        "episodes": "Uknown",
        "duration": "23 min per episode",
        "synopsis": "Second part of Tower of God Season 2."
    },
    {
        "id": 18,
        "title": "Uzumaki",
        "image": "uzumaki.jpg",
        "genre": "Avant Garde, Drama, Horror, Suspense",
        "rating": "6.03",
        "studio": "Akatsuki, Fugaki",
        "status": "Ongoing",
        "type": "TV",
        "episodes": "12",
        "duration": "28 min per episode",
        "synopsis": "In the town of Kurouzu-cho, Kirie Goshima lives a fairly normal life with her family. As she walks to the train station one day to meet her boyfriend, Shuuichi Saito, she sees his father staring at a snail shell in an alley. Thinking nothing of it, she mentions the incident to Shuuichi, who says that his father has been acting weird lately. Shuuichi reveals his rising desire to leave the town with Kirie, saying that the town is infected with spirals.\n\nBut his father's obsession with the shape soon proves deadly, beginning a chain of horrific and unexplainable events that causes the residents of Kurouzu-cho to spiral into madness."
    },
    {
        "id": 19,
        "title": "Blue Lock vs. U-20 Japan",
        "image": "bluelock.jpg",
        "genre": "Sports",
        "rating": "6.80",
        "studio": "8bit",
        "status": "Ongoing",
        "type": "TV",
        "episodes": "14",
        "duration": "23 min per episode",
        "synopsis": "The next phase of the controversial Blue Lock project is underway with the candidate pool being dwindled down to just 35. Out of the remaining strikers, only a select few will be chosen to play in an upcoming exhibition game against the current U-20 Japanese soccer team. Playing in this match comes with a caveat: winning will grant the players the right to represent the nation as the new U-20 team, but losing will bring an end to Blue Lock in its entirety. Among the ones left in the running is Yoichi Isagi, who is coming to terms with his own abilities.\n\nTo further complicate matters, the six best players in the pool have already been named to the starting lineup and the remaining 29 will have to duke it out to claim a coveted spot. Each candidate must select a top six pairing to team up with for the selection to prove their competence. But if this mishmash of strikers wants to overthrow the current U-20 team, they will need to find a way to combine their playstyles effectively."
    },
    {
        "id": 20,
        "title": "Raise wa Tanin ga Ii",
        "image": "raise.jpg",
        "genre": "Romance",
        "rating": "7.20",
        "studio": "Studio DEEN",
        "status": "Ongoing",
        "type": "TV",
        "episodes": "Uknown",
        "duration": "23 min per episode",
        "synopsis": "The next phase of the controversial Blue Lock project is underway with the candidate pool being dwindled down to just 35. Out of the remaining strikers, only a select few will be chosen to play in an upcoming exhibition game against the current U-20 Japanese soccer team. Playing in this match comes with a caveat: winning will grant the players the right to represent the nation as the new U-20 team, but losing will bring an end to Blue Lock in its entirety. Among the ones left in the running is Yoichi Isagi, who is coming to terms with his own abilities.\n\nTo further complicate matters, the six best players in the pool have already been named to the starting lineup and the remaining 29 will have to duke it out to claim a coveted spot. Each candidate must select a top six pairing to team up with for the selection to prove their competence. But if this mishmash of strikers wants to overthrow the current U-20 team, they will need to find a way to combine their playstyles effectively."
    }
]
